<a href="https://colab.research.google.com/github/hellosmallkat/NSDCs-Intermediate-SQL-Project/blob/main/Finished_version_Intermediate_SQL_Queries.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>



<h1 align="center">
    NSDC Data Science Projects
</h1>

<h2 align="center">
    Project: Intermediate SQL Queries - #2
</h2>

<h3 align="center">
    Name: hellosmallkat
</h3>

**Project Description:**

To work with the New York City Airbnb dataset in this project, you'll need to create and connect to an SQLite database as seen in the steps within this notebook.

**Key Features**

- Practical SQL exercises with step-by-step instructions.
- Real-world datasets for hands-on experience.
- Comprehensive explanations of SQL queries and concepts.
- Interactive coding examples and challenges.

**Dataset**
- You can find the New York City Airbnb dataset on Kaggle: [New York City Airbnb Dataset](https://www.kaggle.com/datasets/dgomonov/new-york-city-airbnb-open-data)
- Download the dataset from the provided link and save it as 'AB_NYC_2019.csv' on your computer.
- On colab, click on the "Upload" button and select the 'AB_NYC_2019.csv' file from your local computer.

## Introduction
This SQL project is designed for those who want to practice writing SQL queries using a real-world dataset. In this project, we will work with the New York City Airbnb dataset. The main goal is to practice SQL syntax and intermediate data analysis tasks. Make sure to complete the code where there is a 'TODO' sign. Hints are provided along the way.

## Table of Contents
1. [Libraries and Database Setup](#database-setup)
2. [Loading the Dataset](#loading-dataset)
3. [SQL Queries](#sql-queries)
4. [Closing Connection](#closing-connection)
5. [Summary of Intermediate SQL Commands](#summary-commands)

# Section 1: Libraries and Database Setup <a name="database-setup"></a>

### Task 1.1: Import Libraries
Let's start by importing the necessary libraries.

In [3]:
# Connect to Google Drive
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [4]:
import pandas as pd
import numpy as np
import sqlite3

### Task 1.2: Connect to the Database

Next, establish a connection to the SQLite database named 'airbnb.db'.
Use the sqlite3 library to create a connection object and store it in a variable called 'conn'.

In [5]:
# Completed

# Connect to the SQLite database
conn = sqlite3.connect('airbnb.db')
cursor = conn.cursor()

# Section 2: Loading the Dataset <a name="loading-dataset"></a>

### Task 2.1: Load the Dataset
- You will work with the 'listings' table from the New York City Airbnb dataset.
- Load the dataset from the CSV file 'AB_NYC_2019.csv' into a DataFrame named 'df'.
- Then, import the DataFrame into the 'listings' table in the database using the to_sql() method.

\\

Hint: Use the read_csv() method from pandas to read the CSV file.

In [6]:
# Completed

# Load the dataset into the SQLite database
data_path = 'AB_NYC_2019.csv'
df = pd.read_csv(data_path)
df.to_sql('listings', conn, if_exists='replace', index=False)

48895

# Section 3: Intermediate SQL Tasks <a name="sql-queries"></a>

Query the database: Write SQL queries to analyze the data in the SQLite database. You can use the sqlite3 library to execute the queries and fetch the results.

### Task 3.1: Using Subquery for Aggregation
- Find listings with a price greater than or equal to the maximum price of entire home/apartment listings.

In [15]:
# TODO: Complete the query by adding the SELECT, WHERE, and LIMIT statement

query = """
SELECT id, name, neighbourhood_group, price
FROM listings
WHERE (
    SELECT MAX(price) AS max_price
    FROM listings
    WHERE room_type = 'Entire home/apt'
)
"""
#FROM listings
#-- Select specific columns (id, name, neighbourhood_group, price) from listings
# insert SELECT statement here
#SELECT id, name, neighbourhood_group, price
# insert FROM statement here
#-- where the price is greater than or equal to the maximum price among entire home/apartment listings
# insert WHERE statement here

#-- Limit the results to display only the top 5 listings
# add the LIMIT

In [16]:
# Completed

result = pd.read_sql_query(query, conn)
print("\nExample 2 - Using Subquery for Aggregation:")
print(result)

Example 2 - Using Subquery for Aggregation:
             id                                               name  \
0          2539                 Clean & quiet apt home by the park
1          2595                              Skylit Midtown Castle
2          3647                THE VILLAGE OF HARLEM....NEW YORK !
3          3831                    Cozy Entire Floor of Brownstone
4          5022   Entire Apt: Spacious Studio/Loft by central park
...         ...                                                ...
48890  36484665    Charming one bedroom - newly renovated rowhouse
48891  36485057      Affordable room in Bushwick/East Williamsburg
48892  36485431            Sunny Studio at Historical Neighborhood
48893  36485609               43rd St. Time Square-cozy single bed
48894  36487245  Trendy duplex in the very heart of Hell's Kitchen

      neighbourhood_group  price
0                Brooklyn    149
1               Manhattan    225
2               Manhattan    150
3                Brooklyn     89
4               Manhattan     80
...                   ...    ...
48890            Brooklyn     70
48891            Brooklyn     40
48892           Manhattan    115
48893           Manhattan     55
48894           Manhattan     90

[48895 rows x 4 columns]

### Task 3.2: Using CTE for Clarity
- Create a [Common Table Expression (CTE)](https://learnsql.com/blog/what-is-common-table-expression/) for high-priced listings and retrieve details.

In [17]:
# TODO: Complete the query by first finishing the CTE query  by adding the WHERE statement. Then complete the following SELECT AND FROM statements.

query = """


WITH high_price_listings AS (
    SELECT *
    FROM listings
    WHERE price > 500

)
SELECT id, name, neighbourhood_group, price
FROM high_price_listings


-- Limit the results to display only the top 5 listings
LIMIT 5
"""
#-- Create a common table expression (CTE) to select high-priced listings greater than 500
# insert WHERE the price is greater than 500
#-- Select specific columns (id, name, neighbourhood_group, price) from high-priced listings
# insert SELECT statement
# insert FROM statement
# insert SELECT statement
# insert FROM statement

In [18]:
# Completed

result = pd.read_sql_query(query, conn)
print("\nExample 3 - Using CTE for Clarity:")
print(result)

Example 3 - Using CTE for Clarity:
       id                                   name neighbourhood_group  price
0   19601    perfect for a family or small group            Brooklyn    800
1   68974     Unique spacious loft on the Bowery           Manhattan    575
2   89427                   The Brooklyn Waverly            Brooklyn    650
3  103311      2 BR w/ Terrace @ Box House Hotel            Brooklyn    599
4  174966  Luxury 2Bed/2.5Bath Central Park View           Manhattan   2000

### Task 3.3: Using GROUP BY and HAVING
-  Count the number of listings in each neighbourhood_group with more than 1000 listings.

In [19]:
# TODO: Complete the GROUP_BY and the HAVING COUNT statement to 1000 listings

query = """
SELECT neighbourhood_group, COUNT(*) AS num_listings
FROM listings
GROUP BY neighbourhood_group
HAVING num_listings > 1000
"""
# insert GROUP_BY statement
# insert HAVING COUNT statement

In [20]:
# Completed

result = pd.read_sql_query(query, conn)
print("\nExample 4 - Using GROUP BY and HAVING:")
print(result)

Example 4 - Using GROUP BY and HAVING:
  neighbourhood_group  num_listings
0               Bronx          1091
1            Brooklyn         20104
2           Manhattan         21661
3              Queens          5666

### Task 3.4: Using [CASE Statements](https://www.w3schools.com/sql/sql_case.asp)
- Calculate the count of listings in each neighborhood group categorized into three price ranges: cheap, moderate, and expensive.

In [21]:
# TODO: Complete the third case switch statement for expensive_listings and insert GROUP BY statement

query = """

-- Select the neighborhood_group and use conditional aggregation to count listings in price ranges
SELECT neighbourhood_group,
       SUM(CASE WHEN price <= 100 THEN 1 ELSE 0 END) AS cheap_listings,
       SUM(CASE WHEN price > 100 AND price <= 200 THEN 1 ELSE 0 END) AS moderate_listings,
       SUM(CASE WHEN price > 200 THEN 1 ELSE 0 END) AS expensive_listings
FROM listings

GROUP BY neighbourhood_group
"""
# insert SUM WHEN price > 200 THEN 1 ELSE 0 and label AS expensive_listings
#-- Group the data by neighborhood_group to get counts for each group
# insert GROUP BY statement

In [22]:
# Completed

result = pd.read_sql_query(query, conn)
print("\nExample 5 - Using CASE Statements:")
print(result)

Example 5 - Using CASE Statements:
  neighbourhood_group  cheap_listings  moderate_listings  expensive_listings
0               Bronx             865                181                  45
1            Brooklyn           11771               6278                2055
2           Manhattan            6921               8803                5937
3              Queens            4101               1243                 322
4       Staten Island             270                 78                  25

### Task 3.5: Using [Self-Join](https://www.w3schools.com/sql/sql_join_self.asp) for Data Comparison
- Compare the average price of each neighborhood's listings with the overall average price, highlighting neighborhoods with prices higher than the overall average.

In [39]:
# TODO: Complete the CTE WITH statement, insert SELECT statement, and insert the self-inner join (becareful with parenthesis grouping -- there are two AS assignments)

query = """
-- Create a common table expression (CTE) to calculate the average prices for each neighborhood


WITH avg_prices AS (
    SELECT neighbourhood, AVG(price) AS avg_price
    FROM listings
    GROUP BY neighbourhood
),

overall_avg AS (
    SELECT AVG(price) AS avg_price
    FROM listings
)


SELECT a.neighbourhood, a.avg_price, b.avg_price AS overall_avg
FROM avg_prices AS a


INNER JOIN avg_prices AS b ON 1 = 1

WHERE a.avg_price > b.avg_price
"""
#-- Select the neighborhood, its average price, and the overall average price
# insert SELECT statement of columns with their associated table name
#-- Self-join with a subquery to retrieve the overall average price
# insert INNER JOIN of the AVG(price) save AS avg_price FROM listings and then save it all AS b
#-- Filter for neighborhoods with average prices higher than the overall average

In [40]:
# Completed

result = pd.read_sql_query(query, conn)
print("Example 7 - Using Self-Join for Data Comparison:")
print(result)

Example 7 - Using Self-Join for Data Comparison:
      neighbourhood  avg_price  overall_avg
0          Allerton  87.595238    67.250000
1          Allerton  87.595238    81.764706
2          Allerton  87.595238    75.428571
3          Allerton  87.595238    87.470588
4          Allerton  87.595238    77.125000
...             ...        ...          ...
24304      Woodside  85.097872    69.571429
24305      Woodside  85.097872    80.555556
24306      Woodside  85.097872    71.500000
24307      Woodside  85.097872    67.170455
24308      Woodside  85.097872    60.090909

[24309 rows x 3 columns]

# Section 4: Closing the Database Connection <a name="closing-connection"></a>

### Task 4.1: Close the Cursor and Database Connection
- It's good practice to close the cursor and the database connection when you're done working with the database to free up system resources and maintain proper connection management.

In [41]:
# Completed

# Make sure to include these lines of code at the end of your script to properly close the cursor and database connection.
cursor.close()
conn.close()

# Section 5: Summary of Basic SQL Commands <a name="summary-commands"></a>

In this project, you have practiced various SQL commands and tasks. Below is a summary of the basic SQL commands used:

**Task 1.2: Connect to the Database**
- Established a connection to the SQLite database.

**Task 2.1: Load the Dataset**
- Loaded the dataset into a DataFrame.
- Imported the DataFrame into the database.

**Task 3.1: Using Subquery for Aggregation**
- SQL Commands: SELECT, FROM, WHERE, Subquery, MAX(), LIMIT
- Description: Find listings with a price greater than or equal to the maximum price of entire home/apartment listings.

**Task 3.2: Using CTE for Clarity**
- SQL Commands: WITH, Common Table Expression (CTE), SELECT, FROM, LIMIT
- Description: Create a Common Table Expression (CTE) for high-priced listings and retrieve details.

**Task 3.3: Using GROUP BY and HAVING**
- SQL Commands: SELECT, COUNT(), AS, FROM, GROUP BY, HAVING
- Description: Count the number of listings in each neighbourhood_group with more than 1000 listings.

**Task 3.4: Using CASE Statements**
- SQL Commands: SELECT, SUM(), CASE, WHEN, THEN, ELSE, END, AS, FROM, GROUP BY
- Description: Calculate the count of listings in each neighborhood group categorized into three price ranges: cheap, moderate, and expensive.

**Task 3.5: Using Self-Join for Data Comparison**
- SQL Commands: WITH, Common Table Expression (CTE), SELECT, AVG(), AS, INNER JOIN, ON, Self-Join, WHERE
- Description: Compare the average price of each neighborhood's listings with the overall average price, highlighting neighborhoods with prices higher than the overall average.

**Task 4.1: Close the Cursor and Database Connection**
- Closed the cursor and the database connection.

This summary provides an overview of the intermediate SQL commands used in this project. You can use this as a reference for future SQL projects and data analysis tasks.